[
  {
    "skillId": 1,
    "skillName": "Beginner Guitar Lessons",
    "providerName": "Alex Martin",
    "providerEmail": "alex@skillswap.com",
    "providerImage": "https://i.ibb.co.com/BvTpkXZ/photo-1507003211169-0a1dd7228f2d-w-400-q-80.jpg",
    "providerDescription": "Professional guitar instructor with 8 years of teaching experience. Alex has taught over 200 students and specializes in making music accessible to complete beginners. Certified by the Guitar Foundation of America.",
    "price": 20,
    "rating": 4.8,
    "slotsAvailable": 3,
    "description": "Comprehensive acoustic guitar classes designed specifically for complete beginners with no prior musical experience. In these engaging sessions, you'll learn fundamental chord shapes including G, C, D, Em, and Am, master essential strumming patterns and rhythms, develop proper finger positioning and hand techniques, and play your first complete songs within just a few weeks. Each lesson includes personalized feedback, practice exercises, and downloadable chord charts. Perfect for anyone who's always dreamed of playing guitar but didn't know where to start. All you need is a guitar and enthusiasm!",
    "whatYoullLearn": [
      "Basic chord shapes and transitions (G, C, D, Em, Am, F)",
      "Proper finger positioning and hand posture",
      "Essential strumming patterns and rhythmic techniques",
      "How to read guitar tabs and chord diagrams",
      "Playing 5-10 popular songs from various genres",
      "Basic music theory fundamentals for guitarists",
      "Tuning your guitar by ear and with a tuner",
      "Practice routines to accelerate your progress"
    ],
    "image": "https://i.ibb.co.com/nMz64B2T/photo-1510915361894-db8b60106cb1-w-800-q-80.jpg",
    "category": "Music"
  },
  {
    "skillId": 2,
    "skillName": "Spoken English Practice",
    "providerName": "Sara Hossain",
    "providerEmail": "sara@skillswap.com",
    "providerImage": "https://i.ibb.co.com/5X4HFdcS/photo-1494790108377-be9c29b29330-w-400-q-80.jpg",
    "providerDescription": "TESOL-certified English instructor with a Master's degree in Applied Linguistics. Sara has 6 years of experience helping non-native speakers gain confidence in English communication. She creates a supportive, judgment-free environment for learners.",
    "price": 10,
    "rating": 4.6,
    "slotsAvailable": 5,
    "description": "Dynamic conversational English practice sessions specifically designed for non-native speakers who want to improve their speaking confidence and fluency. These interactive one-on-one sessions focus on real-world communication scenarios including workplace conversations, social situations, job interviews, and everyday interactions. You'll work on pronunciation, accent reduction, vocabulary expansion, common idioms and expressions, and overcoming the fear of making mistakes. Sara creates a comfortable, encouraging atmosphere where you can practice freely without judgment. Each session is tailored to your specific goals and interests, whether you're preparing for a presentation, traveling abroad, or simply want to communicate more effectively in English.",
    "whatYoullLearn": [
      "Natural conversation flow and active listening skills",
      "Pronunciation improvement and accent reduction techniques",
      "Common idioms, phrasal verbs, and colloquial expressions",
      "Vocabulary for workplace, travel, and social situations",
      "Techniques to overcome hesitation and build confidence",
      "Asking questions and clarifying misunderstandings politely",
      "Cultural nuances in English-speaking contexts",
      "Strategies for thinking in English rather than translating"
    ],
    "image": "https://i.ibb.co.com/NDt79KC/photo-1546410531-bb4caa6b424d-w-800-q-80.jpg",
    "category": "Language"
  },
  {
    "skillId": 3,
    "skillName": "React Fundamentals",
    "providerName": "Rafi Ahmed",
    "providerEmail": "rafi@skillswap.com",
    "providerImage": "https://i.ibb.co.com/Q3j5tNCR/photo-1506794778202-cad84cf45f1d-w-400-q-80.jpg",
    "providerDescription": "Senior Frontend Developer with 5 years of React experience working at leading tech companies. Rafi has built 30+ production applications and is passionate about teaching modern web development. Active contributor to open-source React projects.",
    "price": 25,
    "rating": 4.9,
    "slotsAvailable": 2,
    "description": "Intensive hands-on React workshop that takes you from basics to building real-world applications. This comprehensive course covers everything you need to become proficient in React development: understanding components and JSX syntax, mastering React hooks including useState, useEffect, and custom hooks, implementing React Router for navigation, managing application state effectively, working with APIs and handling asynchronous data, and following best practices for code organization and performance optimization. Each session includes live coding exercises, practical projects, and code reviews. You'll build several mini-projects and one complete application by the end of the workshop. Perfect for developers with basic JavaScript knowledge who want to level up their frontend skills and stay relevant in today's job market.",
    "whatYoullLearn": [
      "React components, JSX syntax, and component composition",
      "State management with useState and useReducer hooks",
      "Side effects and data fetching with useEffect",
      "React Router for single-page application navigation",
      "Working with forms, controlled components, and validation",
      "API integration and handling asynchronous operations",
      "Creating custom hooks for reusable logic",
      "Performance optimization techniques and best practices",
      "Debugging React applications with DevTools",
      "Project structure and code organization patterns"
    ],
    "image": "https://i.ibb.co.com/PzFvbxXY/photo-1633356122544-f134324a6cee-w-800-q-80.jpg",
    "category": "Programming"
  },
  {
    "skillId": 4,
    "skillName": "Yoga for Beginners",
    "providerName": "Maya Roy",
    "providerEmail": "maya@skillswap.com",
    "providerImage": "https://i.ibb.co.com/VYt6WYh4/photo-1438761681033-6461ffad8d80-w-400-q-80.jpg",
    "providerDescription": "Certified yoga instructor (RYT-500) with 10 years of teaching experience. Maya specializes in Hatha and Vinyasa yoga and has helped hundreds of beginners start their wellness journey. She emphasizes mindfulness and body-positive practice.",
    "price": 15,
    "rating": 4.7,
    "slotsAvailable": 6,
    "description": "Gentle and accessible yoga classes perfect for complete beginners or those returning to practice after a break. These sessions focus on building a strong foundation in yoga while honoring your body's unique needs and limitations. You'll learn basic yoga poses (asanas) with proper alignment, breathing techniques (pranayama) for relaxation and energy, meditation and mindfulness practices, gentle stretches to improve flexibility and reduce tension, and modifications for different body types and fitness levels. Maya creates a welcoming, non-competitive environment where everyone can progress at their own pace. Each class ends with a deeply relaxing savasana. Regular practice can help reduce stress, improve sleep quality, increase flexibility and strength, and enhance overall well-being. No prior experience or special flexibility required – just bring an open mind and comfortable clothing!",
    "whatYoullLearn": [
      "Foundational yoga poses with proper alignment and safety",
      "Breathing techniques (pranayama) for relaxation and focus",
      "Sun Salutations and basic flow sequences",
      "Modifications and props usage for different body types",
      "Mindfulness and meditation practices for stress relief",
      "Building flexibility, strength, and balance gradually",
      "Body awareness and listening to your physical limits",
      "Relaxation techniques and restorative poses",
      "Creating a personal home practice routine"
    ],
    "image": "https://i.ibb.co.com/xt3Vyb73/photo-1544367567-0f2fcb009e0b-w-800-q-80.jpg",
    "category": "Health"
  },
  {
    "skillId": 5,
    "skillName": "Basic Photography",
    "providerName": "Jamal Khan",
    "providerEmail": "jamal@skillswap.com",
    "providerImage": "https://i.ibb.co.com/275kTK9t/photo-1500648767791-00dcc994a43e-w-400-q-80.jpg",
    "providerDescription": "Professional photographer with 12 years of experience in portrait, landscape, and street photography. Jamal's work has been featured in national exhibitions and he loves sharing his passion for visual storytelling with aspiring photographers.",
    "price": 18,
    "rating": 4.5,
    "slotsAvailable": 4,
    "description": "Comprehensive photography course for beginners that covers everything from camera basics to creating stunning images, whether you're using a smartphone or a DSLR camera. Learn the fundamental principles of composition including the rule of thirds, leading lines, and framing techniques, understand how lighting affects your photos and how to work with natural and artificial light, master camera settings like ISO, aperture, and shutter speed, explore different photography genres including portraits, landscapes, and street photography, and discover essential editing techniques using free and paid software. Each session includes practical shooting assignments and personalized feedback on your work. Jamal will help you develop your unique photographic eye and teach you how to tell compelling visual stories. By the end of this course, you'll have a portfolio of images you're proud to share and the confidence to continue growing as a photographer.",
    "whatYoullLearn": [
      "Composition principles: rule of thirds, leading lines, symmetry",
      "Understanding exposure triangle (ISO, aperture, shutter speed)",
      "Working with natural light and golden hour photography",
      "Portrait photography techniques and posing guidance",
      "Landscape photography and capturing scenic views",
      "Basic photo editing in Lightroom or free alternatives",
      "Smartphone photography tips and mobile editing apps",
      "Street photography and candid moment capture",
      "Building a cohesive photography portfolio",
      "Finding your unique photographic style and vision"
    ],
    "image": "https://i.ibb.co.com/tp6kbCkr/photo-1452587925148-ce544e77e70d-w-800-q-80.jpg",
    "category": "Art"
  },
  {
    "skillId": 6,
    "skillName": "Spanish Conversation",
    "providerName": "Lucia Fernandez",
    "providerEmail": "lucia@skillswap.com",
    "providerImage": "https://i.ibb.co.com/60k0Rmxd/photo-1487412720507-e7ab37603c6f-w-400-q-80.jpg",
    "providerDescription": "Native Spanish speaker from Barcelona with 7 years of teaching experience. Lucia holds a degree in Hispanic Literature and specializes in conversational Spanish. She brings cultural insights and authentic language use to every lesson.",
    "price": 12,
    "rating": 4.6,
    "slotsAvailable": 3,
    "description": "Engaging Spanish conversation practice sessions with a native speaker designed to dramatically improve your speaking confidence and fluency. These interactive sessions focus on practical, everyday Spanish that you'll actually use in real-life situations. Practice common conversational scenarios like ordering food at restaurants, asking for directions, making small talk, discussing hobbies and interests, and handling travel situations. You'll expand your vocabulary with useful phrases and expressions, improve your pronunciation and accent, learn about Spanish and Latin American culture and customs, overcome hesitation and fear of making mistakes, and develop natural conversation flow and listening comprehension. Lucia adapts each session to your current level and interests, whether you're planning a trip to Spain, connecting with Spanish-speaking friends, or advancing your career. The relaxed, encouraging atmosphere makes speaking Spanish feel natural and enjoyable rather than stressful.",
    "whatYoullLearn": [
      "Essential conversational phrases for everyday situations",
      "Proper Spanish pronunciation and accent improvement",
      "Vocabulary for travel, dining, shopping, and socializing",
      "Common idioms and colloquial expressions used by natives",
      "Asking questions and understanding native speaker responses",
      "Cultural nuances and etiquette in Spanish-speaking countries",
      "Verb conjugations in present, past, and future tenses",
      "Building confidence to speak without fear of mistakes",
      "Listening comprehension strategies for real conversations",
      "Differences between Spanish dialects (Spain vs Latin America)"
    ],
    "image": "https://i.ibb.co.com/1tQwK2cP/photo-1489945052260-4f21c52268b9-ixlib-rb-4-1.jpg",
    "category": "Language"
  },
  {
    "skillId": 7,
    "skillName": "Basic Drawing & Sketching",
    "providerName": "Elena Vasquez",
    "providerEmail": "elena@skillswap.com",
    "providerImage": "https://images.unsplash.com/photo-1520813792240-56fc4a3765a7",
    "providerDescription": "Fine arts graduate with 9 years of experience teaching drawing, illustration, and visual fundamentals. Elena has helped over 300 students develop strong foundational art skills through structured, beginner-friendly lessons.",
    "price": 14,
    "rating": 4.7,
    "slotsAvailable": 4,
    "description": "A beginner-friendly drawing course designed to teach you how to see and draw like an artist. Through step-by-step exercises, you'll learn how to observe shapes, build forms using basic geometry, understand values and shading, and create realistic sketches. The lessons cover line control, proportion, perspective, light and shadow, and simple composition techniques. You'll work on fun projects like drawing everyday objects, simple portraits, and nature sketches. Each class includes personalized feedback and printable practice sheets. No prior art experience required — just a pencil and curiosity.",
    "whatYoullLearn": [
      "Basic line exercises for control and confidence",
      "Breaking objects into simple shapes (circles, cubes, cylinders)",
      "Understanding light, shadow, and shading techniques",
      "One-point and two-point perspective fundamentals",
      "Drawing realistic textures like wood, cloth, and metal",
      "Creating simple portrait sketches with proper proportions",
      "Composing balanced and visually appealing sketches",
      "Developing observation skills to draw from real life",
      "Gesture drawing for movement and fluidity",
      "Building your personal sketching style"
    ],
    "image": "https://images.unsplash.com/photo-1513364776144-60967b0f800f",
    "category": "Art"
  },
  {
    "skillId": 8,
    "skillName": "Personal Finance Basics",
    "providerName": "Daniel Carter",
    "providerEmail": "daniel@skillswap.com",
    "providerImage": "https://images.unsplash.com/photo-1507679799987-c73779587ccf",
    "providerDescription": "Certified Financial Planner with 11 years of experience helping young adults build smart financial habits. Daniel has worked with over 500 individuals to create budgets, reduce debt, and improve long-term financial stability.",
    "price": 22,
    "rating": 4.8,
    "slotsAvailable": 5,
    "description": "A practical and beginner-friendly introduction to personal finance designed to help you make smarter money decisions. These sessions cover budgeting, saving, debt management, smart spending habits, understanding interest, emergency funds, and the basics of investing. Daniel emphasizes simple systems you can apply immediately, even if you've struggled with managing money before. You'll learn how to track your expenses, avoid common financial mistakes, set realistic financial goals, and build long-term financial stability with confidence.",
    "whatYoullLearn": [
      "Creating a simple and effective monthly budget",
      "Understanding good vs bad debt and repayment strategies",
      "How interest, inflation, and savings accounts work",
      "Building a realistic emergency fund plan",
      "Smart spending habits and financial discipline",
      "How to set and track financial goals",
      "Basics of investing (stocks, ETFs, mutual funds)",
      "Avoiding common money traps and scams",
      "Credit score improvement tips and responsible usage",
      "Long-term strategies for financial independence"
    ],
    "image": "https://images.unsplash.com/photo-1554224155-6726b3ff858f",
    "category": "Finance"
  }
]
